{"pageProps":{"id":"what-did-i-learn-this-week-2021---22","meta":{"title":"What did I learn this week (2021) - 22","description":"Weekly summarization and review of things I've learned in the final week of May 2021","published":true,"publishedAt":"2021-05-30T00:00:00.000Z","updatedAt":"2021-05-30T00:00:00.000Z","category":"learnings","image":"banners/33","keywords":["Firefox","SerenityOS","QUIC"],"authors":["Krishna Mohan A M"]},"content":"<ol>\n<li>Firefox will be implementing <a href=\"https://developer.chrome.com/docs/extensions/mv3/intro/\">Manifest V3</a> support for extensions to provide compatibility with Chrome extensions. In the <a href=\"https://blog.mozilla.org/addons/2021/05/27/manifest-v3-update/\">blog post</a> they've mentioned they'll be diverging from Chrome's implementation in certain areas but that is not clear as of now.</li>\n<li><a href=\"https://www.serenityos.org/\">SerenityOS</a> is a unix like operating system created by <a href=\"https://twitter.com/awesomekling\">Andreas Kling</a> former Apple engineer. He recently <a href=\"https://awesomekling.github.io/I-quit-my-job-to-focus-on-SerenityOS-full-time/\">quit</a> his full time job to concentrate on this OS. He also maintains a very informative <a href=\"https://www.youtube.com/c/AndreasKling/videos\">youtube channel</a>.</li>\n<li>QUIC is now <a href=\"https://www.rfc-editor.org/info/rfc9000\">RFC 9000</a>. QUIC is a new latency-reducing, reliable, and secure internet transport protocol that is slated to replace TCP, the most commonly used transport today.</li>\n<li>Back in 1930-50's, if you want to watch a Paramount movie, you must go to a Paramount theater. This similar to the modern situation of Netflix movies can only be watched in Netflix VOD (All hail Telegram and torrents 😂). This was one of the popular <a href=\"https://news.ycombinator.com/item?id=27290233\">comment</a> to the HN discussion on 'Amazon buying MGM'.</li>\n<li>Found a <a href=\"https://github.com/AnthonyCalandra/modern-cpp-features\">cheatsheet</a> for modern C++ language and library features.</li>\n<li><a href=\"https://en.wikipedia.org/wiki/Five_whys\">Five whys</a> (or 5 whys) is an iterative interrogative technique used to explore the cause-and-effect relationships underlying a particular problem. The primary goal of the technique is to determine the root cause of a defect or problem by repeating the question \"Why?\". Each answer forms the basis of the next question. The \"five\" in the name derives from an anecdotal observation on the number of iterations needed to resolve the problem.</li>\n<li>Read a <a href=\"https://www.reddit.com/r/ExperiencedDevs/comments/nmodyl/drunk_post_things_ive_learned_as_a_sr_engineer/\">drunk post</a> regarding things learned as Sr. Software Engineer in Reddit and it is really informative and thought provoking.</li>\n</ol>\n"},"__N_SSG":true}