{"pageProps":{"id":"what-did-i-learn-this-week-2021---04","meta":{"title":"What did I learn this week (2021) - 04","description":"Weekly summarization and review of things I've learned in the fourth week of January 2021","published":true,"publishedAt":"2021-01-24T00:00:00.000Z","updatedAt":"2021-01-24T00:00:00.000Z","category":"learnings","image":"banners/11","keywords":["cloud","ddd","css"],"authors":["Krishna Mohan A M"]},"content":"<ol>\n<li>\n<p>How to add css class to an element in <a href=\"https://developers.google.com/web/tools/chrome-devtools/css#classes\">browser devtools</a> with auto completion. I was learning tailwindcss with angular with each change requiring a rebuild. I thought of creating an extension with tailwind intellisense in browser similar to the VS code extension, but then I found this in-built feature.</p>\n</li>\n<li>\n<p><a href=\"https://rhodesmill.org/brandon/2011/concentric-css/\">Concentric CSS</a>: A CSS property suggested ordering: starts outside the box model, moves inward.</p>\n</li>\n<li>\n<p><a href=\"https://en.wikipedia.org/wiki/Windows_Insider\">Widows Insider</a> is an open software testing program by Microsoft that allows users who own a valid license  of Windows 10 or Windows Server 2016 to register for pre-release builds of the operating system previously only accessible to software developers.</p>\n</li>\n<li>\n<p><strong>\"Native advertising\"</strong> is a method of advertising that presents ads as journalism or unbiased articles.</p>\n<p>This technique is used by publications like the New York Times, The Atlantic, Gawker, Buzzfeed, and others. Stories may be marked as sponsored, but disclaimers are subtle because the whole point is that users don't know it's an ad.</p>\n</li>\n<li>\n<p><a href=\"https://martinfowler.com/bliki/PolyglotPersistence.html\">Polyglot Persistence</a>: Applications should be written in a mix of languages to take advantage of the fact that different languages are suitable for tackling different problems.</p>\n</li>\n<li>\n<p><a href=\"https://martinfowler.com/bliki/BoundedContext.html\">Bounded Context</a> - DDD deals with large models by dividing them into different Bounded Contexts and being explicit about their interrelationships.</p>\n</li>\n<li>\n<p><a href=\"https://en.wikipedia.org/wiki/Polysemy\">Polysemy</a> - It is the capacity for a word or phrase to have multiple meanings, usually related by contiguity of meaning within a semantic field.</p>\n</li>\n<li>\n<p><a href=\"https://avinetworks.com/glossary/ssl-termination/\">SSL Termination</a> describes the transition process when data traffic becomes encrypted and unencrypted. This happens at the server end of a secure socket layer (SSL) connection. It helps to speed up the decryption process and reduces the processing burden on backend servers.</p>\n</li>\n<li>\n<p><a href=\"https://helm.sh/docs/topics/charts/\">Helm Charts</a> are not charts and a packaging format. A chart is a collection of files that describe a related set of Kubernetes resources.</p>\n</li>\n</ol>\n"},"__N_SSG":true}