{"pageProps":{"id":"what-did-i-learn-this-week-2021---06","meta":{"title":"What did I learn this week (2021) - 06","description":"Weekly summarization and review of things I've learned in the first week of February 2021","published":true,"publishedAt":"2021-02-07T00:00:00.000Z","updatedAt":"2021-02-07T00:00:00.000Z","category":"learnings","image":"banners/13","keywords":["Politics","Farming"],"authors":["Krishna Mohan A M"]},"content":"<ol>\n<li>Myanmar's third and current constitution was published in 2008 and was drafted by the military named <a href=\"https://en.wikipedia.org/wiki/Tatmadaw\">Tatmadaw</a>. 25% of seats in the Parliament of Myanmar are reserved for serving military officers. The ministries of home, border affairs and defense have to be headed by a serving military officer. The military also appoints one of the country's two vice presidents. Hence, the country's civilian leaders have little influence over the security establishment.</li>\n<li><strong>Shotgun surgery</strong> is an anti-pattern in software development and occurs where a developer adds features to an application codebase which span a multiplicity of implementors or implementations in a single change.</li>\n<li><code>relentless.com</code> redirects to <code>amazon.com</code></li>\n<li><a href=\"https://en.wikipedia.org/wiki/Conway%27s_law\">Conway's law</a> is an adage stating that organizations design systems which mirror their own communication structure.</li>\n<li>How to plant tapioca stem cuttings. A worker named Sibychan, whom I called to help me plant some tapioca in the land showed me how to identify the top and bottom of a tapioca stem cutting. This is perfectly explainded by the below image.</li>\n</ol>\n<p><img src=\"https://www.flgardening.com/wp-content/uploads/2019/02/which-end-of-cassava-do-you-plant.png\" alt=\"Tapioca Stem\"> Source: <a href=\"https://www.flgardening.com/\">flgardening.com</a></p>\n<ol start=\"6\">\n<li>\n<p><a href=\"https://masstransit-project.com/\">MassTransit</a>: MassTransit is a free, open-source distributed application framework for .NET. MassTransit makes it easy to create applications and services that leverage message-based, loosely-coupled asynchronous communication for higher availability, reliability, and scalability.</p>\n</li>\n<li>\n<p><a href=\"https://github.com/khellang/Scrutor\">Scrutor</a> is a small open source library that provides a fluent API to register services in your Microsoft.Extensions.DependencyInjection container based on conventions.</p>\n</li>\n<li>\n<p><a href=\"https://fluentvalidation.net/\">FluentValidation</a>: A small validation library for .NET that uses a fluent interface and lambda expressions for building validation rules.</p>\n</li>\n</ol>\n"},"__N_SSG":true}