{"pageProps":{"id":"nps","meta":{"title":"Notes on NPS","description":"This is supposed to be a beginner's guide to investing in NPS.","published":true,"publishedAt":"2023-07-02T00:00:00.000Z","updatedAt":"2023-07-02T00:00:00.000Z","category":"finance","image":"banners/74","keywords":["NPS","Finance"],"authors":["Krishna Mohan A M"]},"content":"<h3>NPS</h3>\n<ul>\n<li>There is no maximum limit on the amount that you can invest, while the minimum annual contribution is Rs. 500.</li>\n<li>Under NPS, your contributions are invested in 4 different asset classes:\n<ul>\n<li>Equity (Class E)</li>\n<li>Government Securities (Class G)</li>\n<li>Corporate Bonds (Class C)</li>\n<li>Alternative Investment Funds. (Class A)</li>\n</ul>\n</li>\n<li>Types of Annuity Offered Under NPS\n<ul>\n<li>With ROP (The entire annuity purchase prices is paid to the nominees at the time of closure)\n<ul>\n<li>Annuity for Life</li>\n<li>Joint Life</li>\n<li>Family Income</li>\n</ul>\n</li>\n<li>Without ROP (As the original annuity purchase amount is not returned, annuity providers typically offer a higher return in this case as compared to annuity options with ROP.)\n<ul>\n<li>Annuity for Life</li>\n<li>Joint Life</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>Option to change the Fund Manager can be exercised once in a Financial Year.</li>\n<li>Option to change Scheme Preference can be exercised twice in a Financial year.</li>\n<li>NPS Tier 2 is more cost-effective than mutual funds. Its expense ratio doesn't go beyond 0.09 per cent.</li>\n<li>NPS Tier 2 has additional costs in the shape of transaction charges.</li>\n<li>NPS Tier 2 withdrawal process takes a day longer. They disburse the withdrawal amount on a T+3 days basis, while mutual funds have a T+2 days settlement cycle. Here, T is the day on which you placed your withdrawal request.</li>\n</ul>\n<h3>Other Notes</h3>\n<ul>\n<li><strong>Protean</strong> eGov Technologies Limited (earlier known as NSDL e-Governance Infrastructure Limited) offers services related to issuance of PAN cards and also acts as central record-keeping agency for National Pension System (NPS).</li>\n<li>The <strong>secondary market</strong> is where investors buy and sell securities. Trades take place on the secondary market between other investors and traders rather than from the companies that issue the securities. People typically associate the secondary market with the stock market.</li>\n<li>With an aim to safeguard investors' money from misuse and default by stock brokers, SEBI on Monday introduced a supplementary process for trading in the secondary market based on blocked funds in an investor's bank account, instead of transferring them upfront to the trading member. This is similar to <strong>Application Supported by Blocked Amount</strong> (ASBA)-like facility already available for the primary market (IPO) which ensures that money from an investor gets moved only when an allotment happens.</li>\n<li><strong>Annuities</strong> are financial products offered by insurance companies. Annuity purchase involves an initial lump sum investment that can provide you/your family members with a fixed monthly income for a specified time. The individual/individuals who are eligible to receive annuity payouts are known as an annuitant.</li>\n<li>The <strong>expense ratio</strong> is the percentage that denotes the amount of money you are paying to the AMC as a fee to manage your investments. In other words, it is the per-unit cost for running and managing the mutual fund.<br>\n-Indexation does not apply to equity funds.</li>\n</ul>\n<h3>References</h3>\n<ul>\n<li><a href=\"https://www.valueresearchonline.com/stories/52335/comparing-large-cap-and-debt-funds-with-nps-tier-2/\">Comparing large-cap and debt funds with NPS Tier 2</a></li>\n</ul>\n<h3>Acronyms</h3>\n<ul>\n<li>AMC - Asset Management Companies</li>\n<li>ASBA - Application Supported by Blocked Amount</li>\n<li>LTCG - Long Term Capital Gain</li>\n<li>NAV - Net Asset Value</li>\n<li>NPCI - National Payments Corporation of India</li>\n<li>NPS - National Pension System</li>\n<li>NSDL - National Securities Depository Limited</li>\n<li>PAN - Permanent Account Number</li>\n<li>PFRDA - Pension Fund Regulatory Development Authority</li>\n<li>PRAN - Permanent Retirement Account Number</li>\n<li>ROP - Return Of Purchase price</li>\n<li>SEBI - Securities and Exchange Board of India</li>\n</ul>\n"},"__N_SSG":true}