{"pageProps":{"id":"what-did-i-learn-this-week-2021---43","meta":{"title":"What did I learn this week (2021) - 43","description":"Weekly summarization and review of things I've learned in the fourth week of October 2021","published":true,"publishedAt":"2021-10-24T00:00:00.000Z","updatedAt":"2021-10-24T00:00:00.000Z","category":"learnings","image":"banners/54","keywords":["cloud","browsers"],"authors":["Krishna Mohan A M"]},"content":"<ul>\n<li><a href=\"https://www.backblaze.com/\">Backblaze, Inc.</a> is a cloud storage and data backup company, founded in 2007. Its two main products are their B2 Cloud Storage and Computer Backup services, targeted at both business and personal markets. They were in news recently because of IPO announcement.</li>\n<li><a href=\"https://github.com/restic/restic\">Restic</a> &#x26; <a href=\"https://github.com/kopia/kopia\">Kopia</a> are two open source cross platform backup tools.</li>\n<li>The <a href=\"https://en.wikipedia.org/wiki/IP_Code\">IP Code</a>, or Ingress Protection Code is defined in IEC standard 60529 which classifies and rates the degree of protection provided by mechanical casings and electrical enclosures against intrusion, dust, accidental contact, and water. It is published by the International Electrotechnical Commission (IEC). The equivalent European standard is EN 60529. Devices backed by an international standard rating of <strong>IP68</strong> are deemed fit enough to withstand dust, dirt and sand, and are resistant to submersion up to a maximum depth of 1.5m underwater for up to thirty minutes.</li>\n<li><a href=\"https://browser.engineering/\">Web Browser Engineering</a> is an upcoming book about how browser work. One of the author is Chris Harrelson, rendering lead for Chrome.</li>\n<li>Found a detailed guid to <a href=\"https://knowingless.com/2021/10/19/becoming-a-whorelord-the-overly-analytical-guide-to-escorting/\">escorting</a>.</li>\n<li>VS Code is now available in <a href=\"https://vscode.dev/\">browser</a>.</li>\n</ul>\n"},"__N_SSG":true}