{"pageProps":{"id":"what-did-i-learn-this-week-2021---41","meta":{"title":"What did I learn this week (2021) - 41","description":"Weekly summarization and review of things I've learned in the second week of October 2021","published":true,"publishedAt":"2021-10-10T00:00:00.000Z","updatedAt":"2021-10-10T00:00:00.000Z","category":"learnings","image":"banners/52","keywords":["facebook","encryption"],"authors":["Krishna Mohan A M"]},"content":"<ul>\n<li>Facebook and its sister sites faced <a href=\"https://engineering.fb.com/2021/10/04/networking-traffic/outage/\">a mass outage</a> on October 4th. The primary reason being the misconfiguration of facebook's <a href=\"https://en.wikipedia.org/wiki/Border_Gateway_Protocol\">BGP (Border Gateway protocol)</a> records. BGP is a mechanism by which Internet service providers of the world share information about which providers are responsible for routing Internet traffic to which specific groups of Internet addresses. There is a detailed <a href=\"https://www.cloudflare.com/en-gb/learning/security/glossary/what-is-bgp/\">blog post</a> by Cloudfare regarding this protocol and <a href=\"https://blog.cloudflare.com/october-2021-facebook-outage/\">another one</a> on outage.</li>\n<li>PII stands for Personally Identifiable Information.</li>\n<li>Learned about some logging best practises from <a href=\"https://tuhrig.de/my-logging-best-practices/\">a blog</a> and its <a href=\"https://news.ycombinator.com/item?id=28761282\">HN discussion</a>.</li>\n<li><a href=\"https://github.com/gpujs/gpu.js\">GPU.js</a> is a JavaScript Acceleration library for GPGPU (General purpose computing on GPUs) in JavaScript for Web and Node. GPU.js automatically transpiles simple JavaScript functions into shader language and compiles them so they run on your GPU. In case a GPU is not available, the functions will still run in regular JavaScript.</li>\n<li>Found an informative <a href=\"https://goteleport.com/blog/ssh-tunneling-explained/\">blog</a> that explains <em>SSH Tunnelling</em>.</li>\n<li><a href=\"https://cloud.google.com/kms/docs/envelope-encryption\">Envelope Encryption</a>: The process of encrypting a key with another key is known as envelope encryption.</li>\n<li><a href=\"https://github.com/google/tink\">Tink</a> is a multi-language, cross-platform, open source library that provides cryptographic APIs that are secure, easy to use correctly, and hard(er) to misuse.</li>\n</ul>\n"},"__N_SSG":true}