{"pageProps":{"id":"what-did-i-learn-this-week-2021---05","meta":{"title":"What did I learn this week 2021 - 05","description":"Weekly summarization and review of things I've learned in the final week of January 2021","published":true,"publishedAt":"2021-01-31T00:00:00.000Z","updatedAt":"2021-01-10T00:00:00.000Z","category":"learnings","image":"banners/12","keywords":["dark-patterns","Gandhi","Finance"],"authors":["Krishna Mohan A M"]},"content":"<ol>\n<li><a href=\"https://en.wikipedia.org/wiki/Projection_clock\">Projection Clock</a>: I wasn't aware of this product, but seems useful. Need to try it.</li>\n<li><strong>Tendonitis of wrist:</strong> Swelling of the tissues (tendons) connecting muscle to bone in the wrist.</li>\n<li><strong>Flash Cookies:</strong> A flash cookie is a message used in Adobe Flash that is sent from a Web server to a Web browser and is then stored as a data file in the browser. Flash cookies behave like conventional cookies by personalizing the user's experience, but they can hold much more data than conventional cookies.</li>\n<li><strong>Etags:</strong> The ETag HTTP response header is an identifier for a specific version of a resource. It lets caches be more efficient and save bandwidth, as a web server does not need to resend a full response if the content has not changed.</li>\n<li><strong>HSTS:</strong> The HTTP Strict-Transport-Security response header (often abbreviated as HSTS) lets a web site tell browsers that it should only be accessed using HTTPS, instead of using HTTP.</li>\n<li>Gandhi's books are available for free as <a href=\"https://www.mkgandhi.org/ebks/gandhiebooks.htm\">ebooks</a>.</li>\n<li><a href=\"https://www.investopedia.com/terms/s/shortsqueeze.asp\">Short Squeeze</a>: A short squeeze occurs when a stock or other asset jumps sharply higher, forcing traders who had bet that its price would fall, to buy it in order to forestall even greater losses. Their scramble to buy only adds to the upward pressure on the stock's price.</li>\n<li><strong>Pre mortem</strong> : A pre-mortem, or pre-mortem, is a managerial strategy in which a project team imagines that a project or organization has failed, and then works backward to determine what potentially could lead to the failure of the project or organization.</li>\n<li><a href=\"https://webtransparency.cs.princeton.edu/dark-patterns/\">Dark Patterns</a>: There are 15 types of dark patterns categorized into 7 groups as follows:\n<ul>\n<li>\n<p>Sneaking</p>\n<ol>\n<li><strong>Sneak into basket</strong>: Adding additional products to user's cart without their consent.</li>\n<li><strong>Hidden costs</strong>: Revealing previously undisclosed charges to users right before they make a purchase.</li>\n<li><strong>Hidden Subscription</strong>: Charging users a recurring fee under the pretense of a one-time fee or a free trial.</li>\n</ol>\n</li>\n<li>\n<p>Urgency</p>\n<ol start=\"4\">\n<li><strong>Countdown Timer</strong>: Indicating to users that a deal or discount will expire using a counting-down timer.</li>\n<li><strong>Limited-time Message</strong>: Indicating to users that a deal or sale will expire will expire soon without specifying a deadline, thus creating uncertainty.</li>\n</ol>\n</li>\n<li>\n<p>Misdirection</p>\n<ol start=\"6\">\n<li><strong>Confirm Shaming</strong>: Using language and emotion (shame) to steer users away from making a certain choice.</li>\n<li><strong>Visual Interference</strong>: Using style and visual presentation to steer users to or away from certain choices.</li>\n<li><strong>Trick Questions</strong>: Using confusing language to steer users into making certain choices.</li>\n<li><strong>Pressured Selling</strong>: Pre-selecting more expensive variations of a product, or pressuring the user to accept the more expensive variations of a product and related products.</li>\n</ol>\n</li>\n<li>\n<p>Social Proof</p>\n<ol start=\"10\">\n<li><strong>Activity Messages</strong>: Informing the user about the activity on the website (e.g., purchases, views, visits).</li>\n<li><strong>Testimonials of Uncertain Origin</strong>: Testimonials on a product page whose origin is unclear.</li>\n</ol>\n</li>\n<li>\n<p>Scarcity</p>\n<ol start=\"12\">\n<li><strong>Low-stock Message</strong>: Indicating to users that limited quantities of a product are available, increasing its desirability.</li>\n<li><strong>High-demand Message</strong>: Indicating to users that a product is in high-demand and likely to sell out soon, increasing its desirability</li>\n</ol>\n</li>\n<li>\n<p>Obstruction</p>\n<ol start=\"14\">\n<li><strong>Hard to Cancel</strong>: Making it easy for the user to sign up for a recurring subscription but cancellation requires emailing or calling customer care.</li>\n</ol>\n</li>\n<li>\n<p>Forced Action</p>\n<ol start=\"15\">\n<li><strong>Forced Enrollment</strong>: Coercing users to create accounts or share their information to complete their tasks.</li>\n</ol>\n</li>\n</ul>\n</li>\n</ol>\n"},"__N_SSG":true}