{"pageProps":{"id":"what-did-i-learn-this-week-2021---15","meta":{"title":"What did I learn this week (2021) - 15","description":"Weekly summarization and review of things I've learned in the second week of April 2021","published":true,"publishedAt":"2021-04-11T00:00:00.000Z","updatedAt":"2021-04-11T00:00:00.000Z","category":"learnings","image":"banners/25","keywords":["Chrome"],"authors":["Krishna Mohan A M"]},"content":"<ol>\n<li>Unit Conversion is really a pain point in application development. So learned a little bit of <a href=\"https://0.30000000000000004.com/\">floating point math</a>.</li>\n<li>My friend Noble introduced me to the new job portal named <a href=\"https://cutshort.io/\">Cutshort</a>. It is an AI-based recruitment platform and SaaS software used by 8000+ companies, from startups to product giants like Google.</li>\n<li>Learned the different applications of <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/ETag#examples\">E-tags</a> and its implementation in <a href=\"https://docs.microsoft.com/en-us/aspnet/core/performance/caching/middleware?view=aspnetcore-5.0#configuration\">dotnet</a>.</li>\n<li>Engineering manager <a href=\"https://jacobian.org/2018/may/2/engmanager-reading-list/\">reading list</a> compiled by Jacob Kaplan-Moss(lead developer and co-founder of django).</li>\n<li>Learned the use of different background services in Chrome. It is sad that firefox is not supporting all these useful PWA features.\n<ul>\n<li><a href=\"https://developers.google.com/web/updates/2015/12/background-sync\">Background Sync</a> - Background sync is a new web API that lets you defer actions until the user has stable connectivity. This is useful for ensuring that whatever the user wants to send, is actually sent.</li>\n<li><a href=\"https://developers.google.com/web/updates/2018/12/background-fetch\">Background fetch</a> - Background Sync requires the service worker to be alive for the duration of the fetch. That isn't a problem for short bits of work like sending a message, but if the task takes too long the browser will kill the service worker, otherwise it's a risk to the user's privacy and battery. So, what if you need to download something that might take a long time, like a movie, podcasts, or levels of a game. That's what Background Fetch is for. Background Fetch is a web standard available by default since Chrome 74.</li>\n<li><a href=\"https://web.dev/periodic-background-sync/\">Periodic Background Sync</a> - Periodic Background Sync enables web applications to periodically synchronize data in the background, bringing web apps closer to the behavior of a platform-specific app.</li>\n</ul>\n</li>\n<li>Relearned javascript tasks and microtasks from Jake Archibald's very famous <a href=\"https://jakearchibald.com/2015/tasks-microtasks-queues-and-schedules/\">blog post</a>.</li>\n</ol>\n"},"__N_SSG":true}