{"pageProps":{"id":"what-did-i-learn-this-week-2021---21","meta":{"title":"What did I learn this week (2021) - 21","description":"Weekly summarization and review of things I've learned in the fourth week of May 2021","published":true,"publishedAt":"2021-05-23T00:00:00.000Z","updatedAt":"2021-05-23T00:00:00.000Z","category":"learnings","image":"banners/31","keywords":["UX","Project Starline"],"authors":["Krishna Mohan A M"]},"content":"<ol>\n<li>Read a <a href=\"https://fifty.user-interface.io/50_ui_tips.pdf\">nice book</a> about UX design tips written by <a href=\"https://twitter.com/vponamariov\">Victor</a>. It is a collection of tweets than a book, but very helpful.</li>\n<li>Learned about <a href=\"https://en.wikipedia.org/wiki/Cognitive_load\">Cognitive Load</a>.</li>\n<li>Found a <a href=\"https://github.com/psenough/teach_yourself_demoscene_in_14_days\">Teach Yourself Demoscene</a> repository. I haven't heard about this before. The <a href=\"https://en.wikipedia.org/wiki/Demoscene\">demoscene</a> is an international computer art subculture focused on producing demos: self-contained, sometimes extremely small, computer programs that produce audiovisual presentations.</li>\n<li>China uses a different geographic coordinate system than the rest of the world. <a href=\"https://en.wikipedia.org/wiki/World_Geodetic_System\">WGS-84</a> is the most common coordinate system, but China uses <a href=\"https://en.wikipedia.org/wiki/Restrictions_on_geographic_data_in_China#GCJ-02\">GCJ-02</a>, sometimes called Mars Coordinates. Part of GCJ-02 is an algorithm that obfuscates the results. So applying any GCJ-02 coordinate to a globe using WGS-84 coordinates gets distorted like a funhouse mirror. Found this info in <a href=\"https://news.ycombinator.com/item?id=27187915\">HN</a>.</li>\n<li><a href=\"https://blog.google/technology/research/project-starline/\">Project Starline</a> is an experimental video communication method currently in development by Google that allows the user to see a 3D model of the person they are communicating with. My first thought was that it looks like how people communicate with inmates in US prisons.</li>\n</ol>\n"},"__N_SSG":true}