{"pageProps":{"id":"what-did-i-learn-this-week-2021---08","meta":{"title":"What did I learn this week (2021) - 08","description":"Weekly summarization and review of things I've learned in the third week of February 2021","published":true,"publishedAt":"2021-02-21T00:00:00.000Z","updatedAt":"2021-02-21T00:00:00.000Z","category":"learnings","image":"banners/15","keywords":["comics","dotnet"],"authors":["Krishna Mohan A M"]},"content":"<ol>\n<li><strong>Adam Curtis</strong> - I came to know about this British documentary film maker recently, when his <a href=\"https://en.wikipedia.org/wiki/Can%27t_Get_You_Out_of_My_Head_(TV_series)\">new documentary</a> released. He has a unique style of making and his subjects are unconventional. His documentaries are available in his <a href=\"https://www.youtube.com/c/AdamCurtisDocumentary\">youtube channel</a>. I didn't get time to watch it, but need to do that soon.</li>\n<li><a href=\"https://atap.google.com/jacquard/\">Jacquard By Google</a> is a platform for embedding sensors and feedback devices in fabrics and clothing in ways that seem natural and comfortable.  In one basic use-case, users can provide input to a mobile phone by touching or stroking the garment in a designated location. Honestly I'm not impressed by this tech and my thoughts are perfectly summed up by someone in the <a href=\"https://news.ycombinator.com/item?id=26162710\">HN comment</a>.</li>\n<li><a href=\"https://en.wikipedia.org/wiki/Jacquard_machine\">Jacquard Machine</a>: The Jacquard machine is a device fitted to a loom that simplifies the process of manufacturing textiles with such complex patterns as brocade, damask and matelassé.The resulting ensemble of the loom and Jacquard machine is then called a Jacquard loom. The machine was invented by Joseph Marie Jacquard in 1804.</li>\n<li><a href=\"https://compodoc.app/\">Compodoc</a> is a documentation tool for Angular applications. It generates a static documentation of your application.</li>\n<li><strong>Olx wasn't an Indian company.</strong> Damn, I don't know how I got that idea but until last week i was considering olx as an indian company. Recently I watched a video related to AWS presented by Olx engineers and to my surprise they weren't Indians and I googled the company for the first time. OnLine eXchange also known as OLX Group is a <strong>Dutch-domiciled online marketplace</strong> headquartered in Amsterdam, and owned by <strong>Prosus</strong>, the international assets division of <strong>Naspers</strong>, founded in 2006 and operating in 45 countries.</li>\n<li><strong>Teller</strong>: A bank teller is an employee of a bank who deals directly with customers. In some places, this employee is known as a cashier or customer representative.</li>\n<li><a href=\"https://designli.co/blog/a-deep-dive-on-variable-rewards-and-how-to-use-them/\">Variable Reward</a>: Variable reward (or unpredictable reward or variable schedule reward) is reward delivered intermittently. The reinforcement schedule is often designed to maximize behavior. Three Types of Variable Rewards:\n<ul>\n<li>Rewards of the Tribe</li>\n<li>Rewards of the Hunt</li>\n<li>Rewards of the Self</li>\n</ul>\n</li>\n</ol>\n"},"__N_SSG":true}