{"pageProps":{"id":"what-did-i-learn-this-week-2021---23","meta":{"title":"What did I learn this week (2021) - 23","description":"Weekly summarization and review of things I've learned in the first week of June 2021","published":true,"publishedAt":"2021-06-06T00:00:00.000Z","updatedAt":"2021-06-06T00:00:00.000Z","category":"learnings","image":"banners/34","keywords":[null],"authors":["Krishna Mohan A M"]},"content":"<ol>\n<li>Came to know about <a href=\"https://threejs.org/\">threejs</a>, a javascript 3D library. Also found its angular wrapper - <a href=\"https://github.com/nartc/angular-three\">angular-three</a>. Saw <a href=\"https://www.oculus.com/medal-of-honor/\">one of the site</a> developed using threejs and it was freaking awesome. I need to try it, but right now I don't have time for it.</li>\n<li><a href=\"https://www.wsj.com/articles/software-developer-community-stack-overflow-sold-to-tech-giant-prosus-for-1-8-billion-11622648400\">Stack Overflow Sold to Tech Giant Prosus for $1.8 Billion</a>. Not sure it is a good thing or bad thing. When Microsoft bought GitHub I was bit skeptical, but it turn out to be okay. Hoping that this change won't bring any breaking changes to the StackOverflow usage.</li>\n<li><a href=\"https://en.wikipedia.org/wiki/Mandala\">Mandala Art</a>: A mandala is a geometric configuration of symbols. In various spiritual traditions, mandalas may be employed for focusing attention of practitioners and adepts, as a spiritual guidance tool, for establishing a sacred space and as an aid to meditation and trance induction. In the Eastern religions of Hinduism, Buddhism, Jainism and Shintoism it is used as a map representing deities, or specially in the case of Shintoism, paradises, kami or actual shrines.</li>\n<li><a href=\"https://mastershot.app/\">Mastershot App</a> is an online video editor, that helps us to edit videos in the browser and it is free.</li>\n<li>Learned some <a href=\"https://codeforces.com/blog/entry/15643\">C++ tricks</a> that may help me in the Codeforces contests.</li>\n</ol>\n"},"__N_SSG":true}